app/views/students/_form.html.erb

  <div class="form-group">
    <%= collection_select(:classroom, :course_id, Course.all, :id, :name) %>
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."student_id" = $1  [["student_id", 2]]
SELECT "courses".* FROM "courses"