app/views/students/index.html.erb

                <td><%= student.register_number %></td>
                <td><%= student.courses.first.name %></td>
---
SELECT  "courses".* FROM "courses" INNER JOIN "classrooms" ON "courses"."id" = "classrooms"."course_id" WHERE "classrooms"."student_id" = $1  ORDER BY "courses"."id" ASC LIMIT 1  [["student_id", 7]]