app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "description", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Systems Analyst"], ["description", "Systems Analyst"], ["status", "t"], ["created_at", "2015-08-19 18:54:37.674294"], ["updated_at", "2015-08-19 18:54:37.674294"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["name", "Course Updated"], ["description", "Course description"], ["updated_at", "2015-08-20 02:29:51.787981"], ["id", 89]]

  def destroy
    @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 92]]