app/controllers/students_controller.rb

  def create
    Student.transaction do
      @student = Student.new(student_params)

      respond_to do |format|
        if @student.save
          classroom = @student.classrooms.new(classroom_params)
          if classroom.save
---
INSERT INTO "students" ("name", "register_number", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fagner"], ["register_number", "123asd"], ["status", "t"], ["created_at", "2015-08-19 23:50:08.042604"], ["updated_at", "2015-08-19 23:50:08.042604"]]
INSERT INTO "classrooms" ("course_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 1], ["student_id", 2], ["created_at", "2015-08-19 23:39:40.324476"], ["updated_at", "2015-08-19 23:39:40.324476"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = $1, "register_number" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["name", "Fagner Updated"], ["register_number", "123abc"], ["updated_at", "2015-08-20 02:01:50.537473"], ["id", 140]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 1]]